#+STARTUP: indent overview hidestars

**** spatialisation
Spatialisation angles for three rings in triangles.

_1. Load all_
#+call: generate_harmonics()
#+call: make_vbap()
#+call: init_spatialization()
#+call: load_reverb()
#+call: show_meter()
#+call: free_all()

#+begin_src sclang :results none :noweb yes
  <<show_meter>>
#+end_src
_2. Load this_
Call this after running [[*generate harmonics][generate harmonics]] to start the spatialisation of the harmonics. It creates the VBAP instances (inside a Ndef) stored in ~~spatNdefs~. It also fills the ~~controlBus~ array with three channel busses for the control of azimuth, elevation and distance respectively.

The functions controlling panning are here: [[inter_pan][inter_pan]].
#+name: make_vbap
#+begin_src sclang :results none :noweb yes :tangle harmony.sc
  var revMap;
  <<vbap_speaker_array>>
  ~spatChannels = Array.new(~audioBusses.size); // Unused
  ~spatNdefs = Array.new(~audioBusses.size);
  ~reverbSendNdefs = Array.new(~audioBusses.size);
  ~reverbBus = Array.new(~audioBusses.size);
  ~controlBus = Array.new(~audioBusses.size);
  ~reverbSendBus = Bus.audio(s, 1);
  revMap = \sin.asWarp;
  ~audioBusses.do({ arg bus, i;
    o = "reverbBus" ++ i.asString.asSymbol;
    m = "ch" ++ i.asString.asSymbol;
    n = Bus.control(s, 4);
    ~controlBus.add(n);
    ~spatNdefs.add(
          Ndef.new(m, { arg src, azi = 0, ele = 0, spr = 0, dist = 0;
            src = In.ar(bus);
            azi = In.kr(n);
            ele = In.kr(n.index + 1);
            dist = LinLin.kr( In.kr(n.index + 2).squared, 0, 1, 1, 0.00001);
            spr = In.kr(n.index + 3);   
            src = src * dist;
            VBAP.ar(29, src, ~spkrBuffer.bufnum, In.kr(n), In.kr(n.index + 1), spr)});
    );
    ~reverbSendNdefs.add(
          Ndef(o, {
            var src;
            src = In.ar(bus) * In.kr(n.index + 2) * \revScaleI.kr(0.62);
            src = src * (revMap.map(In.kr(n.index + 2) + 1) * \revScaleII.kr(0.62));
            Out.ar(~reverbSendBus.index, src)
          });
    );	
    Ndef(m).fadeTime(1);
    Ndef(m).play(addAction: \addToTail);
    Ndef(o).play(addAction: \addToTail);});
  <<inter_pan>>
  <<update_panning>>
  <<reset_freqs>>
#+end_src

Function to start and stop individual nodes
#+name: play_control
#+begin_src sclang :results none
  var playControl = { arg index = 0, message = 0;
    if(index < ~spatNdefs.size,
          {
            case
            { message == \stop } { ~spatNdefs[index].stop; }
            { message == \play } { ~spatNdefs[index].play; };
          },
          { 
            "The index is outside of the size of thhe ~spatNdefs".postln;	
          });
  };
  playControl.value(0, \play);
#+end_src

Set the reverb
#+begin_src sclang :results none
  var setMe = 0.62;
  ~reverbSendNdefs[0].set(\revScaleI, setMe);
  ~reverbSendNdefs[0].set(\revScaleII, setMe);
  ~reverbSendNdefs[1].set(\revScaleI, setMe);
  ~reverbSendNdefs[1].set(\revScaleII, setMe);
#+end_src

#+begin_src sclang :results none
  ~spatNdefs[1].set(\spr, 0);
#+end_src

Set individual controlbusses
#+begin_src sclang :results none
  //  ~controlBus[0].getn(4, { arg n; n[3].postln; });
  ~controlBus[0].getnSynchronous(4)[3].postln;
  //  ~controlBus[1].getnSynchronous(4);
  ~controlBus[0].setn([147, 23, 0, 0]);
#+end_src

Control individual synths pulse.
#+begin_src sclang :results none
  var pulse = 10, synth = 0;
  ~synths[synth].set(\pulse, 2);
  ~synths[synth].get(\pulse, {arg item; item.postln; });
#+end_src

Set all synths parameter to a value.
#+begin_src sclang :results none
  ~updateSynths = { arg parameter = \trifreq, value = 100;
    var changeAll = ~synths.do({ arg item, i;
          item.set(parameter, value);
          "Setting ".post; parameter.post; " to ".post; value.postln;
    });
  };
  ~updateSynths.value(\nlevel, 0.1);
#+end_src

Set all spatNdefs parameter to a value.
#+begin_src sclang :results none
  ~updateVBAP = { arg parameter = \trifreq, value = 0;
    var changeAll = ~spatNdefs.do({ arg item, i;
          item.set(parameter, value);
          "Setting ".post; parameter.post; " to ".post; value.postln;
    });
  };
  ~updateVBAP.value(\spr, 0);
#+end_src

#+begin_src sclang :results none
  s.reboot;
#+end_src

#+begin_src sclang :results none
  ~reverbSendBus.scope;
#+end_src

#+begin_src sclang :results none
  ~controlBus[0].getnSynchronous(4)[3].scope;
#+end_src

Gradually increase parameter in one synth.
#+begin_src sclang :results none
  var speeder;
  speeder = { arg instance = 0, range = (3..200), delta = 0.5, param = \freq;
    var interpolate;
    interpolate = Task({
          range.do({ arg index;
            ~synths[1].set(param, index);
            delta.wait;	
          });
    });
    interpolate.play;
  };
  speeder.value(0, (150..190), 0.05, \freq);
#+end_src

Interpolate one pulse bus.
#+name: interpolate_pulse
#+begin_src sclang :results none  :tangle harmony.sc
  ~interpolatePulseSingle = { arg int, bus, astart, aend, dur;
    {Out.kr(bus, Line.kr(astart, aend, dur, doneAction: 2))}.play(addAction: \addToHead);
  };
  ~interpolatePulseSingle.value(0, ~frequencyBus[0], 3, 1, 10);
#+end_src

Interpolate all busses. Call this from [[pulse_interpolate_array][pulse_interpolate_array]], that creates an array of values for pulse modulation and interpolation.
#+begin_src sclang :results none  :tangle harmony.sc
  ~interpolatePulse = { arg map;
    map.rowsDo({ arg obj, i;
          if(~logging > 1,
            { 
                  "Starting envelope for item ".post; i.post; " from ".post; obj[0].post; " to ".post; obj[1].post; " in ".post; obj[2].post; " seconds.".postln;						
            }, { });
          {Out.kr(~frequencyBus[i], Line.kr(obj[0], obj[1], obj[2], doneAction: 2))}.play(addAction: \addToHead);
    });
    map;};
  /* Interpolate all busses by the same value */
  //  ~interpolatePulse.value(10, 1, 10);
#+end_src

Create an array of arrays, each with a start, end and dur parameter.
#+name: pulse_modulation
#+begin_src sclang :results none
  ~modulateSpeed = { arg mult = 2, dur = 2, end = 100, mode = 0;
    var mod_map = Array2D.new(~spatNdefs.size, 3);
    mod_map.rowsDo({ arg obj, i;
          mod_map[i,0] = ~frequencyBus[i].getSynchronous;
          switch(mode,
            0, {	
                  mod_map[i,1] = ~frequencyBus[i].getSynchronous * mult * ((i * 0.5) + 1);
            },		
            1, {
                  mod_map[i,1] = end;
            });
          mod_map[i,2] = dur;
    });
  };
  //  ~modulateSpeed.value(2, 2, 200, 0).postln;
  //  ~interpolatePulse.value(mod_map);
#+end_src

Build an array of arguments for the interpolation of the pulse frequence of the instruments. This is always relative to the current pulse frequency. Arguments are:
- ~mult~ multiplier for each iteration in the array
- ~duration~ the duration of the interpolation
- ~end~ end value (only for mode 1)
- ~mode~ the mode of the transformation: 0 = modulation map using the index and multiplier, 1 = linear map using end value for the modulation.
#+name: pulse_interpolate_array
#+begin_src sclang :results none
  ~interpolatePulse.value(~modulateSpeed.value(2, 20, 3, 1));
#+end_src

Create an array and interpolate the pulse frequence of the instruments.
#+begin_src sclang :results none :noweb yes
  <<pulse_modulation>>
  <<interpolate_pulse>>
  ~pulsePresets = { arg preset = 0;
    switch(preset,	
          1, {~interpolatePulse.value(Array2D.fromArray(2, 3, [1, 50, 2, 20, 2000, 2])); },
          2, {~interpolatePulse.value(Array2D.fromArray(2, 3, [1, 5, 2, 20, 20, 2]));},
          3, {~interpolatePulse.value(Array2D.fromArray(2, 3, [1, 5, 1, 1, 6, 1]));},
          4, {~interpolatePulse.value(Array2D.fromArray(2, 3, [1, 5, 1, 1, 4, 1]));},
          5, {~interpolatePulse.value(Array2D.fromArray(2, 3, [1, 2, 5, 1, 1, 6]));},
          6, {
            ~interpolatePulse.value(Array2D.fromArray(2, 3, [2, 32, 30, 1.5, 24, 30]));
            ~setSpatialization.value(\nther, 20);   
          },  
          7,  {
            ~interpolatePulse.value(Array2D.fromArray(2, 3, [1, 2, 20, 2, 1.5, 15]));
            ~setSpatialization.value(\sine, 15);
          },
          8,  {
            ~interpolatePulse.value(Array2D.fromArray(2, 3, [6, 100, 40, 2, 160, 45]));
            ~setSpatialization.value(\sine, 40);
          },
          9,  {
            ~interpolatePulse.value(Array2D.fromArray(2, 3, [100, 200, 40, 160, 6, 45]));
            ~setSpatialization.value(\simple, 40);
          },      
          10,  {
            ~interpolatePulse.value(Array2D.fromArray(2, 3, [1, 5, 5, 20, 2, 2]));
            ~setSpatialization.value(\simple, 5);   
          };	
    ) // switch
  };
  ~pulsePresets.value(1);
#+end_src

#+begin_src sclang :results none
  Array2D.fromArray(2, 3, [1, 5, 2, 20, 20, 2]).postln;
#+end_src

Set and get a bus' value:
#+begin_src sclang :results none
  //  ~frequencyBus[1].set(1);
  ~frequencyBus[1].getSynchronous.postln;
#+end_src

Reset original pulse frequencies.
#+name: reset_freqs
#+begin_src sclang :results none
  ~reset_freqs = { arg index = 0, mode = \all;

    if( (index != 0) && (mode == \all),
          {
            "If mode is = \all, index must be 0".postln;
            index = 0;
          }, { });

    switch(mode,
          \all, {
            ~frequencyBus.do({ arg bus, i;
                  "Setting voice ".post; i.post; " to original frequency: ".post; ~originalFrequencies[i].postln;
                  ~frequencyBus[i].set(~originalFrequencies[i]);
            });
          },
          \single, {
            "Setting voice ".post; index.post; " to original frequency: ".post; ~originalFrequencies[index].postln;
            ~frequencyBus[index].set(~originalFrequencies[index]);
          });
  };
  ~reset_freqs.value(0, \all);
#+end_src

#+begin_src sclang :results none
  ~originalFrequencies[0].postln;
#+end_src

#+begin_src sclang :results none
  ~updatePanning.value(5);
#+end_src

Function for generating the lines for the panning modulation using azimuth, elevation and distance.
#+name: inter_pan
#+begin_src sclang :results none  :tangle harmony.sc
  ~interPan = { arg bus, astart, aend, estart, eend, dstart, dend, sstart, send, dur;
    {Out.kr(bus.index, Line.kr(astart, aend, dur, doneAction: 2))}.play(addAction: \addToHead);
    {Out.kr(bus.index + 1, Line.kr(estart, eend, dur, doneAction: 2))}.play(addAction: \addToHead);
    {Out.kr(bus.index + 2, Line.kr(dstart, dend, dur, doneAction: 2))}.play(addAction: \addToHead);
    //          {Out.kr(bus.index + 3, Line.kr(sstart, send, dur, doneAction: 2))}.play(addAction: \addToHead);
    if(~logging > 1,
          {
            "Azimuth from ".post; astart.post; " to ".post; aend.postln;
            "Elevation from ".post; estart.post; " to ".post; eend.postln;
            "Distance from ".post; dstart.post; " to ".post; dend.postln;
            "Spread from ".post; sstart.post; " to ".post; send.postln;	   
          }, { });
  };
#+end_src

~update_panning~ is called to update panning positions in the ~spatNdefs~ arrays. The actual modulation happens in [[inter_pan_full][inter_pan]]. The function takes one argument:
- ~duration~: The interpolation time.
#+name: update_panning
#+begin_src sclang :results none :tangle harmony.sc :noweb yes
  <<inter_pan>>
  ~updatePanning = { arg duration;
    ~spatNdefs.do({ arg channel, i;
          ~spatializations[i].postln;	
          ~interPan.value(~controlBus[i],
            ~controlBus[i].getnSynchronous(3)[0], ~spatializations[i][0],
            ~controlBus[i].getnSynchronous(3)[1], ~spatializations[i][1],
            ~controlBus[i].getnSynchronous(3)[2], ~spatializations[i][2],
            //                          ~controlBus[i].getnSynchronous(4)[3], ~spatializations[i][3],
            0, ~spatializations[i][3],   
            duration);
    }); // end of spatNdefs.do
  }; //end of function
#+end_src

#+begin_src sclang :results none
  ~controlBus[1].getnSynchronous(3)[0].postln;
#+end_src
#+begin_src sclang :results none
  ~spatializations[1].postln;
#+end_src
#+begin_src sclang :results none
  ~updatePanning.value(5);
#+end_src

_3 Setting spatialization_

Loads necesary auxilliary functions and copies over the positions according to the ~spat_array~ argument. If provided it should be an array (length equal to the number of spat channels) of arrays, each of which is an array with [azimuth, elevation, distance and spread]. It calls ~~updatePanning~ before exiting. The function takes one arguments:
- ~spat_array~: An array of arrays with he indexes in the ~~allRings~ array to be copied over, the distancs and the spread.
#+name: set_spatialization
#+begin_src sclang :results none :noweb yes  :tangle harmony.sc
  <<spat_function>>
  <<update_panning>>
  ~setSpatPositions = { arg spat_array;
    ~spatializations.do({ arg item, i;
          var pos;
          /* Get the x/y position */	
          if(spat_array.size == 0,
            {
                  /* The call to ~setSpatPositions was done without an argument */
                  pos = ~spatializations.at(i);
                  if(~spatializations.at(i).size < 4,
                    {
                          pos.extend(4, 0);      
                    },
                    {
                    });      
            }, 
            {
                  /* The call to ~setSpatPositions was done with an argument */
                  pos = ~allRings.wrapAt(spat_array.wrapAt(i)[0]);
                  pos.put(2, spat_array.wrapAt(i)[1]);
                  pos.put(3, spat_array.wrapAt(i)[2]);
                  pos.postln;    
            }); /* End of if(spat_array.size) */
          /* update the distance parameter */
          pos.postln;  
          ~spatializations.put(i, pos);
          if(~logging > 1,
            {
                  "Set panning:".postln;
                  "Putting spat angles ".post;  pos[0].post; "/".post; pos[1].post; " at index ".post; i.post; " with distance ".post; pos[2].post; " and spread ".post; pos[3].postln;
            }, { }); // if logging
    }); // spatialilzation.do
    ~updatePanning.value(10);
  };
#+end_src

#+name: init_spatialization
#+begin_src sclang :results none :noweb yes
  <<set_spatialization>>
  ~setSpatPositions.value();
#+end_src
#+begin_src sclang :results none
  ~spatializations.at(0).size.postln;
#+end_src

Change spatialization. Spat is controlled by an arbitrary length array that points to one of the 14 (0-13) speaker positions available. Use the ~spat_function~ to create new presets.
#+begin_src sclang :results none
  ~setSpatialization.value(\distanceO, 10);
  ~setSpatialization.value(\distanceI, 5);
#+end_src

#+begin_src sclang :results none
  ~setSpatialization.value(\simple, 5);
#+end_src

#+begin_src sclang :results none
  var dist = 0.5, pos;
  pos = ~allRings.wrapAt([0,10].wrapAt(0));
  pos.put(2, dist);
#+end_src
#+name: spat_function
#+begin_src sclang :results none
  ~setSpatialization = { arg preset, time;
    switch(preset,
          \simple, { ~setSpatPositions.value([[0, 0.0, 90.0], [5, 0.0, 80.0]]); },
          \distanceI, { ~setSpatPositions.value([[0, 0.0], [1, 0.0]]); },
          \distanceO, { ~setSpatPositions.value([[0, 1], [1, 1]]); },
          \nther, { ~setSpatPositions.value([[3, 0.1], [0, 0.6]]); },
          \sine, { ~setSpatPositions.value([[0.0, 0.1], [2.0, 0.2], [4.0, 0.3], [6.0, 0.4], [7.0, 0.3], [9.0, 0.3], [10.0, 0.2], [12.0, 0.1], [13.0, 0.1], [13.0 , 0.1], [ 13.0, 0.1], [ 13.0, 0.1], [ 3.0, 0.1], [13.0 , 0.1], [12.0, 0.1], [10.0, 0.1], [9.0 , 0.1], [7.0, 0.1], [6.0, 0.1], [4.0, 0.1], [2.0, 0.1]]); },
          \frontTop, { ~setSpatPositions.value([[9, 0.3], [12, 0.4], [9, 0.3], [12, 0.3],[9, 0.3],[12, 0.3],[9, 0.3],[12, 0.3],[8, 0.3],[9, 0.3]]); },
          \back, { ~setSpatPositions.value([6,5,4,3,3,4,5,6,11,10,11,10,11,10,11]); },
          \allInOne, { ~setSpatPositions.value(Array.fill(15, { arg i; 1; })); },
          \random, { ~setSpatPositions.value(Array.rand(~spatializations.size, 0, 14)); });
  };
#+end_src

_4. Free all_
Free all busses and stop execution
#+name: free_all
#+begin_src sclang :results none :noweb yes
  <<free_busses>>
  Ndef(\reverbBus).clear;
  Ndef(\reverb).clear;
  CmdPeriod.run;
#+end_src

Reboot Supercollider
#+begin_src sclang :results none
  s.reboot;
#+end_src

Show meter
#+name: show_meter
#+begin_src sclang :results none
  s.meter;
#+end_src

Plot tree
#+name: plot_tree
#+begin_src sclang :results none
  s.plotTree
#+end_src
--------------------------------

#+begin_src sclang :results none
  ~audioBusses[1].scope;
#+end_src

#+name: spat_list
#+begin_src scheme :var mult=0.01 :noweb yes :results output
  <<sequenced_array>>
  (map (lambda (x)
         (format #t "~a, " (truncate (* x 14))))
       (seq-array-sin 0 21 (list)))
#+end_src

#+RESULTS: spat_list
: ice-9/boot-9.scm:1669:16: In procedure raise-exception:
: Unbound variable: seq-array-sin
: 
: Entering a new prompt.  Type `,bt' for a backtrace or `,q' to continue.
: scheme@(guile-user) [1]> 

